Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1025DAA288.atdf
         <register caption="" name="PORTF" offset="0x520" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RF0" />
            <bitfield mask="0x00000002" name="RF1" />
            <bitfield mask="0x00000004" name="RF2" />
            <bitfield mask="0x00000008" name="RF3" />
            <bitfield mask="0x00000010" name="RF4" />
            <bitfield mask="0x00000020" name="RF5" />
            <bitfield mask="0x00000100" name="RF8" />
            <bitfield mask="0x00001000" name="RF12" />
            <bitfield mask="0x00002000" name="RF13" />
         </register>
         <register caption="" name="PORTG" offset="0x620" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RG0" />
            <bitfield mask="0x00000002" name="RG1" />
            <bitfield mask="0x00000040" name="RG6" />
            <bitfield mask="0x00000080" name="RG7" />
            <bitfield mask="0x00000100" name="RG8" />
            <bitfield mask="0x00000200" name="RG9" />
            <bitfield mask="0x00001000" name="RG12" />
            <bitfield mask="0x00002000" name="RG13" />
            <bitfield mask="0x00004000" name="RG14" />
            <bitfield mask="0x00008000" name="RG15" />
         </register>
         <register caption="" name="PORTH" offset="0x720" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RH0" />
            <bitfield mask="0x00000002" name="RH1" />
            <bitfield mask="0x00000004" name="RH2" />
            <bitfield mask="0x00000008" name="RH3" />
            <bitfield mask="0x00000010" name="RH4" />
            <bitfield mask="0x00000020" name="RH5" />
            <bitfield mask="0x00000040" name="RH6" />
            <bitfield mask="0x00000080" name="RH7" />
            <bitfield mask="0x00000100" name="RH8" />
            <bitfield mask="0x00000200" name="RH9" />
            <bitfield mask="0x00000400" name="RH10" />
            <bitfield mask="0x00000800" name="RH11" />
            <bitfield mask="0x00001000" name="RH12" />
            <bitfield mask="0x00002000" name="RH13" />
            <bitfield mask="0x00004000" name="RH14" />
            <bitfield mask="0x00008000" name="RH15" />
         </register>
         <register caption="" name="PORTJ" offset="0x820" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RJ0" />
            <bitfield mask="0x00000002" name="RJ1" />
            <bitfield mask="0x00000004" name="RJ2" />
            <bitfield mask="0x00000008" name="RJ3" />
            <bitfield mask="0x00000010" name="RJ4" />
            <bitfield mask="0x00000020" name="RJ5" />
            <bitfield mask="0x00000040" name="RJ6" />
            <bitfield mask="0x00000080" name="RJ7" />
            <bitfield mask="0x00000100" name="RJ8" />
            <bitfield mask="0x00000200" name="RJ9" />
            <bitfield mask="0x00000400" name="RJ10" />
            <bitfield mask="0x00000800" name="RJ11" />
            <bitfield mask="0x00001000" name="RJ12" />
            <bitfield mask="0x00002000" name="RJ13" />
            <bitfield mask="0x00004000" name="RJ14" />
            <bitfield mask="0x00008000" name="RJ15" />
         </register>
         <register caption="" name="PORTK" offset="0x920" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RK0" />
            <bitfield mask="0x00000002" name="RK1" />
            <bitfield mask="0x00000004" name="RK2" />
            <bitfield mask="0x00000008" name="RK3" />
            <bitfield mask="0x00000010" name="RK4" />
            <bitfield mask="0x00000020" name="RK5" />
            <bitfield mask="0x00000040" name="RK6" />
            <bitfield mask="0x00000080" name="RK7" />
         </register>
         <register caption="" name="LATA" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATA0" />
            <bitfield mask="0x00000002" name="LATA1" />
            <bitfield mask="0x00000004" name="LATA2" />
            <bitfield mask="0x00000008" name="LATA3" />
            <bitfield mask="0x00000010" name="LATA4" />
            <bitfield mask="0x00000020" name="LATA5" />
            <bitfield mask="0x00000040" name="LATA6" />
            <bitfield mask="0x00000080" name="LATA7" />
            <bitfield mask="0x00000200" name="LATA9" />
            <bitfield mask="0x00000400" name="LATA10" />
            <bitfield mask="0x00004000" name="LATA14" />
            <bitfield mask="0x00008000" name="LATA15" />
         </register>
         <register caption="" name="LATB" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATB0" />
            <bitfield mask="0x00000002" name="LATB1" />
            <bitfield mask="0x00000004" name="LATB2" />
            <bitfield mask="0x00000008" name="LATB3" />
            <bitfield mask="0x00000010" name="LATB4" />
            <bitfield mask="0x00000020" name="LATB5" />
            <bitfield mask="0x00000040" name="LATB6" />
            <bitfield mask="0x00000080" name="LATB7" />
            <bitfield mask="0x00000100" name="LATB8" />
            <bitfield mask="0x00000200" name="LATB9" />
            <bitfield mask="0x00000400" name="LATB10" />
            <bitfield mask="0x00000800" name="LATB11" />
            <bitfield mask="0x00001000" name="LATB12" />
            <bitfield mask="0x00002000" name="LATB13" />
            <bitfield mask="0x00004000" name="LATB14" />
            <bitfield mask="0x00008000" name="LATB15" />
         </register>
         <register caption="" name="LATC" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x00000002" name="LATC1" />
            <bitfield mask="0x00000004" name="LATC2" />
            <bitfield mask="0x00000008" name="LATC3" />
            <bitfield mask="0x00000010" name="LATC4" />
            <bitfield mask="0x00001000" name="LATC12" />
            <bitfield mask="0x00002000" name="LATC13" />
            <bitfield mask="0x00004000" name="LATC14" />
            <bitfield mask="0x00008000" name="LATC15" />
         </register>
         <register caption="" name="LATD" offset="0x330" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATD0" />
            <bitfield mask="0x00000002" name="LATD1" />
            <bitfield mask="0x00000004" name="LATD2" />
            <bitfield mask="0x00000008" name="LATD3" />
            <bitfield mask="0x00000010" name="LATD4" />
            <bitfield mask="0x00000020" name="LATD5" />
            <bitfield mask="0x00000040" name="LATD6" />
            <bitfield mask="0x00000080" name="LATD7" />
            <bitfield mask="0x00000200" name="LATD9" />
            <bitfield mask="0x00000400" name="LATD10" />
            <bitfield mask="0x00000800" name="LATD11" />
            <bitfield mask="0x00001000" name="LATD12" />
            <bitfield mask="0x00002000" name="LATD13" />
            <bitfield mask="0x00004000" name="LATD14" />
            <bitfield mask="0x00008000" name="LATD15" />
         </register>
         <register caption="" name="LATE" offset="0x430" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATE0" />
            <bitfield mask="0x00000002" name="LATE1" />
            <bitfield mask="0x00000004" name="LATE2" />
            <bitfield mask="0x00000008" name="LATE3" />
            <bitfield mask="0x00000010" name="LATE4" />
            <bitfield mask="0x00000020" name="LATE5" />
            <bitfield mask="0x00000040" name="LATE6" />
            <bitfield mask="0x00000080" name="LATE7" />
            <bitfield mask="0x00000100" name="LATE8" />
            <bitfield mask="0x00000200" name="LATE9" />
         </register>
