Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1025DAA288.atdf
      <value-group caption="Error Control bit" name="SBT0ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT1ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT2ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT3ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT4ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT5ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT6ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT7ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT8ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT9ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT10ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT11ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT12ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT13ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT14ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT15ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Control bit" name="SBT16ECON__ERRP">
         <value caption="Report protection group violation errors" name="" value="0x1" />
         <value caption="Do not report protection group violation errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT0REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT0REG0__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT0REG1__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT0REG1__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG0__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG2__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT1REG2__PRI">
         <value caption="Level 2" name="" value="0x1" />
         <value caption="Level 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Region Size bits" name="SBT1REG3__SIZE">
         <value caption="Region is not present" name="" value="0x0" />
         <value caption="Region is 1024 bytes" name="" value="0x1" />
         <value caption="Region is 2048 bytes" name="" value="0x2" />
         <value caption="Region is 4096 bytes" name="" value="0x3" />
      </value-group>
