Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1025DAA288.atdf
      <value-group caption="Data CRC Error Interrupt Flag bit" name="SDHCINTSTAT__DCRCEIF">
         <value caption="Data CRC error has occurred" name="" value="0x1" />
         <value caption="Data CRC error has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Data End Bit Error Interrupt Flag bit" name="SDHCINTSTAT__DEBEIF">
         <value caption="Data End bit error has occurred" name="" value="0x1" />
         <value caption="Data End bit error has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Error Interrupt Flag bit" name="SDHCINTSTAT__CLEIF">
         <value caption="Current-limit error has occurred" name="" value="0x1" />
         <value caption="Current-limit error has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto CMD12 Error Interrupt Flag bit" name="SDHCINTSTAT__ACEIF">
         <value caption="Auto CMD12 error has occurred" name="" value="0x1" />
         <value caption="Auto CMD12 error has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="ADMA Error Interrupt Flag bit" name="SDHCINTSTAT__ADEIF">
         <value caption="ADMA error has occurred" name="" value="0x1" />
         <value caption="ADMA error has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Block Gap Interrupt Flag Enable bit" name="SDHCINTEN__BGIE">
         <value caption="Block gap event interrupt flag is enabled" name="" value="0x1" />
         <value caption="Block gap event interrupt flag is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Interrupt Flag Enable bit" name="SDHCINTEN__DMAIE">
         <value caption="DMA interrupt flag is enabled" name="" value="0x1" />
         <value caption="DMA interrupt flag is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Buffer Write Ready Interrupt Flag Enable bit" name="SDHCINTEN__BWRDYIE">
         <value caption="Buffer write ready interrupt flag is enabled" name="" value="0x1" />
         <value caption="Buffer write ready interrupt flag is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Buffer Read Ready Interrupt Flag Enable bit" name="SDHCINTEN__BRRDYIE">
         <value caption="Buffer read ready interrupt flag is enabled" name="" value="0x1" />
         <value caption="Buffer read ready interrupt flag is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Card Insertion Interrupt Flag Enable bit" name="SDHCINTEN__CARDIIE">
         <value caption="Card insertion interrupt flag is enabled" name="" value="0x1" />
         <value caption="Card insertion interrupt flag is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Card Removal Interrupt Flag Enable bit" name="SDHCINTEN__CARDRIE">
         <value caption="Card removal interrupt flag is enabled" name="" value="0x1" />
         <value caption="Card removal interrupt flag is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Card Interrupt Flag Enable bit" name="SDHCINTEN__CARDIE">
         <value caption="Card interrupt flag is enabled" name="" value="0x1" />
         <value caption="Card interrupt flag is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Block Gap Interrupt Signal Enable bit" name="SDHCINTSEN__BGISE">
         <value caption="Block gap event signal is enabled" name="" value="0x1" />
         <value caption="Block gap event signal is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Interrupt Signal Enable bit" name="SDHCINTSEN__DMAISE">
         <value caption="DMA interrupt signal is enabled" name="" value="0x1" />
         <value caption="DMA interrupt signal is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Buffer Write Ready Interrupt Signal Enable bit" name="SDHCINTSEN__BWRDYISE">
         <value caption="Buffer write ready signal is enabled" name="" value="0x1" />
         <value caption="Buffer write ready signal is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Buffer Read Ready Interrupt Signal Enable bit" name="SDHCINTSEN__BRRDYISE">
         <value caption="Buffer read ready signal is enabled" name="" value="0x1" />
         <value caption="Buffer read ready signal is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Card Insertion Interrupt Signal Enable bit" name="SDHCINTSEN__CARDIISE">
         <value caption="Card insertion signal is enabled" name="" value="0x1" />
         <value caption="Card insertion signal is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Card Removal Interrupt Signal Enable bit" name="SDHCINTSEN__CARDRISE">
         <value caption="Card removal signal is enabled" name="" value="0x1" />
         <value caption="Card removal signal is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Card Interrupt Signal Enable bit" name="SDHCINTSEN__CARDISE">
         <value caption="Card interrupt signal is enabled" name="" value="0x1" />
         <value caption="Card interrupt signal is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Command Time-out Error Interrupt Signal Enable bit" name="SDHCINTSEN__CTOEISE">
         <value caption="Command time-out error signal is enabled" name="" value="0x1" />
         <value caption="Command time-out error signal is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Command CRC Error Interrupt Signal Enable bit" name="SDHCINTSEN__CCRCEISE">
         <value caption="Command CRC error signal is enabled" name="" value="0x1" />
         <value caption="Command CRC error signal is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Command End Bit Error Interrupt Signal Enable bit" name="SDHCINTSEN__CEBEISE">
         <value caption="Command End bit error signal is enabled" name="" value="0x1" />
         <value caption="Command End bit error signal is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Command Index Error Interrupt Signal Enable bit" name="SDHCINTSEN__CIDXEISE">
         <value caption="Command index error signal is enabled" name="" value="0x1" />
         <value caption="Command index error signal is masked" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Time-out Error Interrupt Signal Enable bit" name="SDHCINTSEN__DTOEISE">
         <value caption="Data time-out error signal is enabled" name="" value="0x1" />
         <value caption="Data time-out error signal is masked" name="" value="0x0" />
      </value-group>
